rkz/extension/DataProcessors/ПрайсЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПрайсЛист</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ГлубинаОтбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

rkz/extension/Enums/ВариантыНавигацииВФормахНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыНавигацииВФормахНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоСвойствам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоНоменклатуре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоВидам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

rkz/extension/Enums/ВариантыРасчетаЦенНаборов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыРасчетаЦенНаборов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РассчитываетсяИзЦенКомплектующих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

rkz/extension/DataProcessors/ПрайсЛист/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
&Вместо("ПрименитьНастройки")
Процедура бит_ПрименитьНастройки(АдресВоВременномХранилище, ДанныеРедактированияПрайсЛиста)

	АдресХранилищаКэшаДанных = "";

	Если АдресВоВременномХранилище <> Неопределено Тогда

		СтруктураДанных = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище); // см. УстановкаЦенКлиентСервер.НоваяСтруктураНастроекФормы
		
		// Первыйбит Лист требований [20]  [Совветников Д.Г.] [05.07.2024] +
		Объект.бит_ГлубинаОтбора = СтруктураДанных.бит_ГлубинаОтбора;
		// Первыйбит Лист требований [20]  [Совветников Д.Г.] [05.07.2024] -
		
		КомпоновщикНастроекОтбор.ЗагрузитьНастройки(СтруктураДанных.НастройкиКомпоновщика);
		УстановкаЦенСервер.НастроитьЗаголовокОтбора(ЭтотОбъект);

		Если СтруктураДанных.Свойство("НастройкиКомпоновщикаКолонок") И ЗначениеЗаполнено(СтруктураДанных.НастройкиКомпоновщикаКолонок) Тогда
			КомпоновщикНастроекОтборКолонок.ЗагрузитьНастройки(СтруктураДанных.НастройкиКомпоновщикаКолонок);
		КонецЕсли;

		Для Каждого СтрокаТЧ Из СтруктураДанных.ВыбранныеЦены Цикл	
			СтрокаДанныхФормы = УстановкаЦенКлиентСервер.НайтиСтрокуВидаЦен(ВыбранныеЦены, СтрокаТЧ[0]);
			Если СтрокаДанныхФормы <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаДанныхФормы, СтрокаТЧ,, "АдресСхемыКомпоновкиДанных, АдресНастроекСхемыКомпоновкиДанных, АдресНастроекСхемыКомпоновкиДанныхОтбораПоНоменклатуре");
			КонецЕсли;
		КонецЦикла;

		ВыбранныеЦены.Сортировать("РеквизитДопУпорядочивания,Наименование");

		СтруктураДанных.Свойство("ВариантГруппировки",ВариантГруппировки);

		ВыбранныеЦены.Сортировать("РеквизитДопУпорядочивания");

		Дата = СтруктураДанных.Дата;

		ВидНастройки = СтруктураДанных.ВидНастройки;
		ТаблицаПараметровОтбора.Загрузить(СтруктураДанных.ТаблицаПараметровОтбора);

		ВариантНавигации = СтруктураДанных.ВариантНавигации;
		ВидНоменклатуры = СтруктураДанных.ВидНоменклатуры;
		ВариантНеобходимостиУстановкиЦены = СтруктураДанных.ВариантНеобходимостиУстановкиЦены; 

		УстановленыНастройкиОтбора = КомпоновщикНастроекОтбор.Настройки.Отбор.Элементы.Количество() > 0;

	КонецЕсли;

	Элементы.ДеревоЦенВидНоменклатуры.Видимость = Ложь;

	ДобавляемыеКолонки = Новый Структура;
	Если ВариантГруппировки = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии Тогда
		ДобавляемыеКолонки.Вставить("ИерархияЭтоГруппа",Новый ОписаниеТипов("Булево"));
		ДобавляемыеКолонки.Вставить("ЭтоИерархия",Новый ОписаниеТипов("Булево"));
	ИНачеЕсли ВариантГруппировки = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам Тогда
		ДобавляемыеКолонки.Вставить("ИерархияЭтоГруппа",Новый ОписаниеТипов("Булево"));
		ДобавляемыеКолонки.Вставить("ЭтоИерархия",Новый ОписаниеТипов("Булево"));
		ДобавляемыеКолонки.Вставить("ВидНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
		Элементы.ДеревоЦенНоменклатура.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ДеревоЦенВидНоменклатуры.Видимость = Истина;
	Иначе
		Элементы.ДеревоЦенНоменклатура.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;

	РеквизитыДерева = ПолучитьРеквизиты("ДеревоЦен");
	Если ДобавляемыеКолонки.Количество() Тогда
		Для каждого РеквизитДерева Из РеквизитыДерева Цикл
			Если ДобавляемыеКолонки.Свойство(РеквизитДерева.Имя) Тогда
				ДобавляемыеКолонки.Удалить(РеквизитДерева.Имя);
			КонецЕсли; 
		КонецЦикла;

		Для каждого КолонкаДерева Из ДобавляемыеКолонки Цикл
			Массив = Новый Массив;
			Массив.Добавить(Новый РеквизитФормы(КолонкаДерева.Ключ,КолонкаДерева.Значение,"ДеревоЦен"));
			ИзменитьРеквизиты(Массив);
		КонецЦикла;
	Конецесли;

	//++ Локализация
	Если ЗначениеЗаполнено(ДанныеРедактированияПрайсЛиста) Тогда
		ТорговыеПредложенияВызовСервераУТ.НастройкиПрайсЛиста(ЭтотОбъект, ДанныеРедактированияПрайсЛиста)
	КонецЕсли;
	//-- Локализация

	Объект.Товары.Очистить();

	ВариантыРасчетаЦеныНабора = Новый Массив;
	ВариантыРасчетаЦеныНабора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыРасчетаЦенНаборов.ПустаяСсылка"));
	ВариантыРасчетаЦеныНабора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям"));
	ВариантыРасчетаЦеныНабора.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам"));

	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ОбязательныеПоля"   , Новый Массив);
	СтруктураНастроек.Вставить("ПараметрыДанных"    , Новый Структура);
	СтруктураНастроек.Вставить("КомпоновщикНастроек", Неопределено);
	СтруктураНастроек.Вставить("ИмяМакетаСхемыКомпоновкиДанных" , Неопределено);
	СтруктураНастроек.Вставить("ВестиУчетСертификатовНоменклатуры" , Ложь);
	СтруктураНастроек.Вставить("ЦеныНаДату", КонецДня(Дата));
	//
	СтруктураНастроек.Вставить("бит_ГлубинаОтбора", Объект.бит_ГлубинаОтбора);

	СтруктураНастроек.Вставить("ОтборПоВариантуРасчетаЦенНаборов", ВариантыРасчетаЦеныНабора);

	ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	ИспользоватьСерииНоменклатуры          = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
	ИспользуетсяЦенообразование25          = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25(Дата);

	СтруктураНастроек.ОбязательныеПоля.Добавить("Номенклатура");
	Если ИспользуетсяЦенообразование25 Тогда
		Если ИспользоватьХарактеристикиНоменклатуры Тогда
			СтруктураНастроек.ОбязательныеПоля.Добавить("Характеристика");
			СтруктураНастроек.ОбязательныеПоля.Добавить("ХарактеристикаЦО");
		КонецЕсли;
		Если ИспользоватьСерииНоменклатуры Тогда
			СтруктураНастроек.ОбязательныеПоля.Добавить("Серия");
			СтруктураНастроек.ОбязательныеПоля.Добавить("СерияЦО");
		КонецЕсли;
		Если ИспользоватьУпаковкиНоменклатуры Тогда
			СтруктураНастроек.ОбязательныеПоля.Добавить("УпаковкаЦО");
		КонецЕсли;
	Иначе	
		Если ИспользоватьХарактеристикиНоменклатуры Тогда
			СтруктураНастроек.ОбязательныеПоля.Добавить("Характеристика");
		КонецЕсли;
	КонецЕсли;

	СтруктураНастроек.КомпоновщикНастроек = Новый Структура("Настройки"	, КомпоновщикНастроекОтбор.Настройки);
	Если ИспользуетсяЦенообразование25 Тогда
		СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "Макет2_5";
	Иначе	
		СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "Макет";
	КонецЕсли;

	ВыбранныеЦены.Сортировать("РеквизитДопУпорядочивания");
	УстановкаЦенСервер.ПостроитьДеревоЦен(ЭтотОбъект);
	УстановитьВидимостьКолонокРедактирования(ЭтотОбъект, ИспользоватьРежимРедактирования);

	// подготавливаем данные для запуска длительной операции заполнения
	СтруктураФормы = ИнициализироватьСтруктуруФормы();

	ПараметрыФормирования = Новый Структура;
	ПараметрыФормирования.Вставить("СтруктураФормы"			, СтруктураФормы);
	ПараметрыФормирования.Вставить("СтруктураНастроек"		, СтруктураНастроек);
	ПараметрыФормирования.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);

	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ПараметрыФормирования);

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	РезультатРасчетаДлительнойОперации = ДлительныеОперации.ВыполнитьВФоне("Обработки.ПрайсЛист.ПрименитьНастройкиВФоне",
	ПараметрыЗадания,
	ПараметрыВыполнения);

	ИдентификаторЗадания						= РезультатРасчетаДлительнойОперации.ИдентификаторЗадания;
	АдресХранилищаРезультатаВыполненияЗадания 	= РезультатРасчетаДлительнойОперации.АдресРезультата;

	Если РезультатРасчетаДлительнойОперации.Статус = "Выполнено" Тогда
		ПрименитьНастройкиВФонеЗавершение();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.ГиперссылкаУстановленОтбор.Видимость = Истина;
КонецПроцедуры
